In [124]:
import pandas as pd

In [3]:
# allow us to see more rows in output tables for validation purposes

pd.set_option('display.max_rows', 1000)

In [5]:
# There are 4 different CSV files that we need to concatenate. This is the first file representing the first week.
# Importing the first file and checking it before importing the next 3 files.

df1 = pd.read_csv(r'C:\Users\mulka\Downloads\Week1 - 22-Jul-to-28-Jul-2023.csv')
df1.head()

,Rank,Artist,Title
0,1,Peggy Gou,(It Goes Like) Nanana (Edit)
1,2,Billie Eilish,What Was I Made For? [From The Motion Picture ...
2,3,Jain,Makeba
3,4,Teya Dora,D탑anum
4,5,Bibi Babydoll & Dj Brunin XM,Automotivo Bibi Fogosa

In [7]:
# The first check looked good, so importing the next 3 files.

df2 = pd.read_csv(r'C:\Users\mulka\Downloads\Week2 - 29-Jul-to-4-Aug-2023.csv')
df3 = pd.read_csv(r'C:\Users\mulka\Downloads\Week3 - 5-Aug-to-11-Aug-2023.csv')
df4 = pd.read_csv(r'C:\Users\mulka\Downloads\Week4 - 11-Aug-to-17-Aug-2023.csv')

In [8]:
# Creating variables to add the week number to each respective file

Week1 = "Week 1"
Week2 = "Week 2"
Week3 = "Week 3"
Week4 = "Week 4"

In [80]:
# Adding the week number and date to each of the 4 dataframes

df1['Week Number'] = Week1
df1['date'] = '07/28/2023'
df1.head()

,Rank,Artist,Title,Week Number,date
0,1,Peggy Gou,(It Goes Like) Nanana (Edit),Week 1,07/28/2023
1,2,Billie Eilish,What Was I Made For? [From The Motion Picture ...,Week 1,07/28/2023
2,3,Jain,Makeba,Week 1,07/28/2023
3,4,Teya Dora,D탑anum,Week 1,07/28/2023
4,5,Bibi Babydoll & Dj Brunin XM,Automotivo Bibi Fogosa,Week 1,07/28/2023

In [88]:
# Adding week number and closing date to the other 3 dataframes

df2[['Week Number', 'date']] = [Week2, '08/04/2023']
df3[['Week Number', 'date']] = [Week3, '08/11/2023']
df4[['Week Number', 'date']] = [Week4, '08/18/2023']

In [133]:
# concatenating the 4 dataframes together

df_concat = pd.concat([df1, df2, df3, df4])
df_concat.head()

,Rank,Artist,Title,Week Number,date
0,1,Peggy Gou,(It Goes Like) Nanana (Edit),Week 1,07/28/2023
1,2,Billie Eilish,What Was I Made For? [From The Motion Picture ...,Week 1,07/28/2023
2,3,Jain,Makeba,Week 1,07/28/2023
3,4,Teya Dora,D탑anum,Week 1,07/28/2023
4,5,Bibi Babydoll & Dj Brunin XM,Automotivo Bibi Fogosa,Week 1,07/28/2023

In [97]:
# Checking to make sure data types are correct

df_concat.dtypes

Rank            int64
Artist         object
Title          object
Week Number    object
date           object
dtype: object

In [101]:
# changing 'date' to date dtype

df_concat['date'] = pd.to_datetime(df_concat['date'])
df_concat.head(3)

,Rank,Artist,Title,Week Number,date
0,1,Peggy Gou,(It Goes Like) Nanana (Edit),Week 1,2023-07-28
1,2,Billie Eilish,What Was I Made For? [From The Motion Picture ...,Week 1,2023-07-28
2,3,Jain,Makeba,Week 1,2023-07-28

In [117]:
# Checking new dtypes to make sure date change works

df_concat.dtypes

Rank                    int64
Artist                 object
Title                  object
Week Number            object
date           datetime64[ns]
dtype: object

In [134]:
# creating a pivot table from the concatenated dataset to see how each song's rank changed week-by-week

df_pivot = pd.pivot_table(df_concat, values='Rank', index='Title', columns='Week Number')
df_pivot.head()

Week Number                          Week 1  Week 2  Week 3  Week 4
Title
(It Goes Like) Nanana (Edit)            1.0     1.0     1.0     1.0
3:15 (Slowed Down + Reverb)           122.0   141.0   139.0   128.0
7 Seconds (feat. Coco & Pape Diouf)     NaN     NaN   161.0   155.0
Aber sie                              170.0   192.0   180.0     NaN
African Vibe PT 2                      37.0    50.0    57.0    70.0

In [126]:
df_pivot.columns

Index(['Week 1', 'Week 2', 'Week 3', 'Week 4'], dtype='object', name='Week Number')

In [135]:
# resetting index so "title" is recognized as a column

df_pivot.reset_index(inplace=True)
df_pivot.head()

Week Number,Title,Week 1,Week 2,Week 3,Week 4
0,(It Goes Like) Nanana (Edit),1.0,1.0,1.0,1.0
1,3:15 (Slowed Down + Reverb),122.0,141.0,139.0,128.0
2,7 Seconds (feat. Coco & Pape Diouf),NaN,NaN,161.0,155.0
3,Aber sie,170.0,192.0,180.0,NaN
4,African Vibe PT 2,37.0,50.0,57.0,70.0

In [136]:
df_pivot.columns

Index(['Title', 'Week 1', 'Week 2', 'Week 3', 'Week 4'], dtype='object', name='Week Number')

In [137]:
# Exporting dataframe to csv

df_pivot.to_csv('Pandora.csv', index=True)